<h1 id="tocheading">Table of Contents</h1>
<div id="toc"></div>

In [1]:
%%javascript
$.getScript('https://kmahelona.github.io/ipython_notebook_goodies/ipython_notebook_toc.js')

### 612. Shortest Distance in a Plane

Table point_2d holds the coordinates (x,y) of some unique points (more than two) in a plane.

Write a query to find the shortest distance between these points rounded to 2 decimals.
| x  | y  |
|----|----|
| -1 | -1 |
| 0  | 0  |
| -1 | -2 |

The shortest distance is 1.00 from point (-1,-1) to (-1,2). So the output should be:
| shortest |
|----------|
| 1.00     |
Note: The longest distance among all the points are less than 10000.

```mysql
/* SELECT ROUND(SQRT(MIN((a.x-b.x)*(a.x-b.x)+(a.y-b.y)*(a.y-b.y))),2) as shortest
FROM point_2d a, point_2d b
WHERE a.x!=b.x OR a.y!=b.y */

# a little more optimized
SELECT ROUND(SQRT(MIN((a.x-b.x)*(a.x-b.x)+(a.y-b.y)*(a.y-b.y))),2) as shortest
FROM point_2d a, point_2d b
WHERE (a.x>=b.x AND a.y!=b.y) OR (a.x>b.x AND a.y=b.y)
```

### 613. Shortest Distance in a Line

Table point holds the x coordinate of some points on x-axis in a plane, which are all integers.

Write a query to find the shortest distance between two points in these points.
| x   |
|-----|
| -1  |
| 0   |
| 2   |

The shortest distance is '1' obviously, which is from point '-1' to '0'. So the output is as below:
| shortest|
|---------|
| 1       |

Note: Every point is unique, which means there is no duplicates in table point.
Follow-up: What if all these points have an id and are arranged from the left most to the right most of x axis?

```mysql
SELECT MIN(ABS(a.x-b.x)) AS shortest
FROM point a
JOIN point b
ON a.x!=b.x
```

### 614. Second Degree Follower

In facebook, there is a follow table with two columns: followee, follower.

Please write a sql query to get the amount of each followerâ€™s follower if he/she has one.
For example:
+-------------+------------+
| followee    | follower   |
+-------------+------------+
|     A       |     B      |
|     B       |     C      |
|     B       |     D      |
|     D       |     E      |
+-------------+------------+
should output:
+-------------+------------+
| follower    | num        |
+-------------+------------+
|     B       |  2         |
|     D       |  1         |
+-------------+------------+
Explaination:
Both B and D exist in the follower list, when as a followee, B's follower is C and D, and D's follower is E. A does not exist in follower list.

Note:
Followee would not follow himself/herself in all cases.
Please display the result in follower's alphabet order.

```mysql
# SELECT a.follower as follower, b.follower
SELECT a.follower as follower, COUNT(DISTINCT b.follower) AS num
FROM follow a
JOIN follow b
ON a.follower=b.followee
GROUP BY a.follower
HAVING num>0
ORDER BY follower
```

### 615. Average Salary: Departments VS Company

Given two tables as below, write a query to display the comparison result (higher/lower/same) of the average salary of employees in a department to the company's average salary.

Table: salary
| id | employee_id | amount | pay_date   |
|----|-------------|--------|------------|
| 1  | 1           | 9000   | 2017-03-31 |
| 2  | 2           | 6000   | 2017-03-31 |
| 3  | 3           | 10000  | 2017-03-31 |
| 4  | 1           | 7000   | 2017-02-28 |
| 5  | 2           | 6000   | 2017-02-28 |
| 6  | 3           | 8000   | 2017-02-28 |

The employee_id column refers to the employee_id in the following table employee.
| employee_id | department_id |
|-------------|---------------|
| 1           | 1             |
| 2           | 2             |
| 3           | 2             |

So for the sample data above, the result is:
| pay_month | department_id | comparison  |
|-----------|---------------|-------------|
| 2017-03   | 1             | higher      |
| 2017-03   | 2             | lower       |
| 2017-02   | 1             | same        |
| 2017-02   | 2             | same        |

Explanation
In March, the company's average salary is (9000+6000+10000)/3 = 8333.33...
The average salary for department '1' is 9000, which is the salary of employee_id '1' since there is only one employee in this department. So the comparison result is 'higher' since 9000 > 8333.33 obviously.

The average salary of department '2' is (6000 + 10000)/2 = 8000, which is the average of employee_id '2' and '3'. So the comparison result is 'lower' since 8000 < 8333.33.
With he same formula for the average salary comparison in February, the result is 'same' since both the department '1' and '2' have the same average salary with the company, which is 7000.

```mysql
-- MYSQL
SELECT Y.pay_month, Y.department_id,
    CASE
        WHEN dept_salary>avg_salary THEN 'higher'
        WHEN dept_salary<avg_salary THEN 'lower'
        ELSE 'same'
        END AS comparison
FROM (SELECT distinct date_format(pay_date, '%Y-%m') as pay_month, department_id,
    AVG(amount) AS avg_salary
    FROM salary s
    JOIN employee e
    ON s.employee_id=e.employee_id
    GROUP BY pay_month) AS X
JOIN (SELECT distinct date_format(pay_date, '%Y-%m') as pay_month, department_id,
    AVG(amount) AS dept_salary
    FROM salary s
    JOIN employee e
    ON s.employee_id=e.employee_id
    GROUP BY pay_month, department_id) AS Y
ON X.pay_month=Y.pay_month
ORDER BY Y.department_id

-- SQL server
SELECT pay_month, department_id, 
    CASE 
        WHEN dept_salary>avg_salary THEN 'higher'
        WHEN dept_salary<avg_salary THEN 'lower'
        ELSE 'same'
    END AS comparison
FROM (SELECT distinct format(pay_date, 'yyyy-MM') as pay_month,
    department_id,
    AVG(amount) OVER (PARTITION BY format(pay_date, 'yyyy-MM')) as avg_salary,
    AVG(amount) OVER (PARTITION BY CONCAT_WS('-', format(pay_date, 'yyyy-MM'), department_id)) as dept_salary
FROM salary s
JOIN employee e
ON s.employee_id=e.employee_id) AS X
ORDER BY department_id
```

### 618. Students Report By Geography

A U.S graduate school has students from Asia, Europe and America. The students' location information are stored in table student as below.
| name   | continent |
|--------|-----------|
| Jack   | America   |
| Pascal | Europe    |
| Xi     | Asia      |
| Jane   | America   |

Pivot the continent column in this table so that each name is sorted alphabetically and displayed underneath its corresponding continent. The output headers should be America, Asia and Europe respectively. It is guaranteed that the student number from America is no less than either Asia or Europe.

For the sample input, the output is:
| America | Asia | Europe |
|---------|------|--------|
| Jack    | Xi   | Pascal |
| Jane    |      |        |

Follow-up: If it is unknown which continent has the most students, can you write a query to generate the student report?

```mysql
-- MYSQL
select min(America) as America, min(Asia) as Asia, min(Europe) as Europe
from
(select @r1:=0, @r2:=0, @r3:=0) t, 
(select case when continent='America' then (@r1:=@r1+1)
            when continent='Asia' then (@r2:=@r2+1)
            when continent='Europe' then (@r3:=@r3+1) end as RowNumber,
    case when continent='America' then Name end as America,
    case when continent='Asia' then Name end as Asia,
    case when continent='Europe' then Name end as Europe
  from student
  order by Name
) Temp
group by RowNumber

/*SELECT 
    America, Asia, Europe
FROM
    (SELECT @as:=0, @am:=0, @eu:=0) as t,
    (SELECT 
        @as:=@as + 1 AS asid, name AS Asia
    FROM
        student
    WHERE
        continent = 'Asia'
    ORDER BY Asia) AS t1
        RIGHT JOIN
    (SELECT 
        @am:=@am + 1 AS amid, name AS America
    FROM
        student
    WHERE
        continent = 'America'
    ORDER BY America) AS t2 ON asid = amid
        LEFT JOIN
    (SELECT 
        @eu:=@eu + 1 AS euid, name AS Europe
    FROM
        student
    WHERE
        continent = 'Europe'
    ORDER BY Europe) AS t3 ON amid = euid*/
    
-- SQL server
SELECT America, Asia, Europe
FROM(
    SELECT continentorder,
    MAX(CASE WHEN continent = 'America' THEN name END )AS America,
    MAX(CASE WHEN continent = 'Europe' THEN name END )AS Europe,
    MAX(CASE WHEN continent = 'Asia' THEN name END )AS Asia
    FROM (
    SELECT *,
        ROW_NUMBER()OVER(PARTITION BY continent ORDER BY name) AS continentorder
        FROM student
    ) AS SOURCE
    GROUP BY continentorder
) temp
```

### 619. Biggest Single Number

Table my_numbers contains many numbers in column num including duplicated ones.
Can you write a SQL query to find the biggest number, which only appears once.
+---+
|num|
+---+
| 8 |
| 8 |
| 3 |
| 3 |
| 1 |
| 4 |
| 5 |
| 6 | 
For the sample data above, your query should return the following result:
+---+
|num|
+---+
| 6 |
Note:
If there is no such number, just output null.

```mysql
SELECT MAX(A.num) AS num
FROM (
    SELECT num, count(*) as num_count
    FROM my_numbers
    GROUP BY num
    HAVING num_count=1) AS a
```

### 620. Not Boring Movies

X city opened a new cinema, many people would like to go to this cinema. The cinema also gives out a poster indicating the moviesâ€™ ratings and descriptions.
Please write a SQL query to output movies with an odd numbered ID and a description that is not 'boring'. Order the result by rating.

For example, table cinema:
+---------+-----------+--------------+-----------+
|   id    | movie     |  description |  rating   |
+---------+-----------+--------------+-----------+
|   1     | War       |   great 3D   |   8.9     |
|   2     | Science   |   fiction    |   8.5     |
|   3     | irish     |   boring     |   6.2     |
|   4     | Ice song  |   Fantacy    |   8.6     |
|   5     | House card|   Interesting|   9.1     |
+---------+-----------+--------------+-----------+
For the example above, the output should be:
+---------+-----------+--------------+-----------+
|   id    | movie     |  description |  rating   |
+---------+-----------+--------------+-----------+
|   5     | House card|   Interesting|   9.1     |
|   1     | War       |   great 3D   |   8.9     |
+---------+-----------+--------------+-----------+

```mysql
SELECT *
FROM cinema
WHERE (id%2)=1 AND description!='boring'
ORDER by rating DESC
```

### 626. Exchange Seats

Mary is a teacher in a middle school and she has a table seat storing students' names and their corresponding seat ids.
The column id is continuous increment.

Mary wants to change seats for the adjacent students.
Can you write a SQL query to output the result for Mary?
+---------+---------+
|    id   | student |
+---------+---------+
|    1    | Abbot   |
|    2    | Doris   |
|    3    | Emerson |
|    4    | Green   |
|    5    | Jeames  |
+---------+---------+
For the sample input, the output is:
+---------+---------+
|    id   | student |
+---------+---------+
|    1    | Doris   |
|    2    | Abbot   |
|    3    | Green   |
|    4    | Emerson |
|    5    | Jeames  |
+---------+---------+

```mysql
SELECT CASE
    WHEN (id%2=1 AND id=a.max_id) then id
    WHEN (id%2=1 AND id<a.max_id) then id+1
    WHEN (id%2=0) THEN id-1 END AS id,
    student
FROM seat, (select max(id) as max_id from seat) as a
ORDER BY id ASC
/*SELECT
    s1.id, COALESCE(s2.student, s1.student) AS student
FROM
    seat s1
        LEFT JOIN
    seat s2 ON ((s1.id + 1) ^ 1) - 1 = s2.id
ORDER BY s1.id;*/
```

### 627. Swap Salary

Given a table salary, such as the one below, that has m=male and f=female values. Swap all f and m values (i.e., change all f values to m and vice versa) with a single update statement and no intermediate temp table.
Note that you must write a single update statement, DO NOT write any select statement for this problem.

Example:
| id | name | sex | salary |
|----|------|-----|--------|
| 1  | A    | m   | 2500   |
| 2  | B    | f   | 1500   |
| 3  | C    | m   | 5500   |
| 4  | D    | f   | 500    |
After running your update statement, the above salary table should have the following rows:
| id | name | sex | salary |
|----|------|-----|--------|
| 1  | A    | f   | 2500   |
| 2  | B    | m   | 1500   |
| 3  | C    | f   | 5500   |
| 4  | D    | m   | 500    |

```mysql
UPDate salary
SET sex=case when sex='f' then 'm' else 'f' end;
```

### 1045. Customers Who Bought All Products

Table: Customer
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| customer_id | int     |
| product_key | int     |
+-------------+---------+
product_key is a foreign key to Product table.
Table: Product
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| product_key | int     |
+-------------+---------+
product_key is the primary key column for this table.

Write an SQL query for a report that provides the customer ids from the Customer table that bought all the products in the Product table.

For example:
Customer table:
+-------------+-------------+
| customer_id | product_key |
+-------------+-------------+
| 1           | 5           |
| 2           | 6           |
| 3           | 5           |
| 3           | 6           |
| 1           | 6           |
+-------------+-------------+
Product table:
+-------------+
| product_key |
+-------------+
| 5           |
| 6           |
+-------------+
Result table:
+-------------+
| customer_id |
+-------------+
| 1           |
| 3           |
+-------------+
The customers who bought all the products (5 and 6) are customers with id 1 and 3.

```mysql
/* SELECT customer_id
FROM customer
WHERE product_key IN (
    SELECT product_key)
GROUP BY customer_id
HAVING COUNT(DISTINCT product_key)>=(
    SELECT COUNT(product_key)
    FROM product
)*/

SELECT T.CUSTOMER_ID AS customer_id
FROM (
    SELECT DISTINCT C.CUSTOMER_ID, COUNT( DISTINCT P.PRODUCT_KEY) AS CT
    FROM CUSTOMER AS C
    INNER JOIN PRODUCT AS P
    ON C.PRODUCT_KEY = P.PRODUCT_KEY
    GROUP BY C.CUSTOMER_ID
    HAVING CT = (
        SELECT COUNT(DISTINCT PRODUCT_KEY)
        FROM PRODUCT)
) AS T
```

### 1050. Actors and Directors Who Cooperated At Least Three Times

Table: ActorDirector
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| actor_id    | int     |
| director_id | int     |
| timestamp   | int     |
+-------------+---------+
timestamp is the primary key column for this table.

Write a SQL query for a report that provides the pairs (actor_id, director_id) where the actor have cooperated with the director at least 3 times.
Example:
ActorDirector table:
+-------------+-------------+-------------+
| actor_id    | director_id | timestamp   |
+-------------+-------------+-------------+
| 1           | 1           | 0           |
| 1           | 1           | 1           |
| 1           | 1           | 2           |
| 1           | 2           | 3           |
| 1           | 2           | 4           |
| 2           | 1           | 5           |
| 2           | 1           | 6           |
+-------------+-------------+-------------+
Result table:
+-------------+-------------+
| actor_id    | director_id |
+-------------+-------------+
| 1           | 1           |
+-------------+-------------+
The only pair is (1, 1) where they cooperated exactly 3 times.

```mysql
SELECT actor_id as ACTOR_ID, director_id AS DIRECTOR_ID
FROM actordirector
GROUP BY actor_id, director_id
HAVING COUNT(*)>=3
```